# Map과 Apply의 차이

In [32]:
import pandas as pd
a1 = ["4등","3등","1등","2등"]
a2 = ["마시기", "커피사오기", "만원", "2만원"]
idx1 = ["송중기", "김나현", "권보아", "박효신"]
col1 = ["국어", "영어", "수학"]
val1 = [[82,81,77], [91,95,83], [78,72,88], [82,87,72]]
s1 = pd.Series(["80점", "75점", "77점", "60점"], index=idx1)
s2 = pd.Series(a1, index=idx1)
s3 = pd.Series(a2, index=["1등", "2등", "3등", "4등"])
df1 = pd.DataFrame(val1, index=idx1, columns=col1)
df2 = df1.applymap(lambda x: str(x) + "점").copy()

In [19]:
s1
# 80"점"이라고 values를 써서 계산을 못하네

송중기    80점
김나현    75점
권보아    77점
박효신    60점
dtype: object

In [9]:
s1.map(lambda x: int(x[0:2]))

송중기    80
김나현    75
권보아    77
박효신    60
dtype: int64

In [12]:
s2.map(s3)

송중기      2만원
김나현       만원
권보아      마시기
박효신    커피사오기
dtype: object

In [23]:
s2.apply(lambda x: s3.loc[x])

송중기      2만원
김나현       만원
권보아      마시기
박효신    커피사오기
dtype: object

## map과 apply의 공통점과 차이
### 1. map과 apply는 함수의 결과로 맵핑할 때 쓸 수 있다.
### 2. map은 시리즈를 대상으로만 사용할 수 있다.
### 3. map은 딕셔너리나 시리즈의 ket값으로 바로 맵핑이 가능하다
### 4. apply도 key값으로 바로 맵핑이 안된다는 것뿐 동일한 결과는 함수의 맵핑으로 얻을 수 있다.

# Apply와 ApplyMap의 차이

In [34]:
df2.apply(lambda x:x[:2], axis= 1)
# 한줄에 슬라이싱을 한다.

      국어   영어
송중기  82점  81점
김나현  91점  95점
권보아  78점  72점
박효신  82점  87점

In [35]:
df2.applymap(lambda x:x[:2])

     국어  영어  수학
송중기  82  81  77
김나현  91  95  83
권보아  78  72  88
박효신  82  87  72

In [39]:
for i in df2.columns:
    df2[i] = df2[i].apply(lambda x:x[:2])
df2

     국어  영어  수학
송중기  82  81  77
김나현  91  95  83
권보아  78  72  88
박효신  82  87  72

applymap과 apply의 공통점과 차이
1. applymap과 apply는 함수의 결과로 맵핑할 때 쓸 수 있다.
2. applymap은 데이터프레임을 대상으로만 사용할 수 있다.
3. applymap은 한칸한칸을 함수를 적용해 맵핑하고 apply는 한줄한줄을 함수를 적용해 맵핑한다.
4. apply도 시리즈대상으로 한칸한칸 적용되므로 모든 열의 시리즈를 for문으로 적용하면 applymap처럼 적용가능. (axix= 0)